#1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['буква', 21, '21', 21.5, 'false', False]
print(f'Список: {my_list}')
print(f'{my_list[0]} {type(my_list[0])}')
print((my_list[1]), type(my_list[1]))
print(f'{my_list[2]} {type(my_list[2])}')
print(f'{my_list[3]} {type(my_list[3])}')
print(f'{my_list[4]} {type(my_list[4])}')
print(f'{my_list[5]} {type(my_list[5])}')





